ci4/app/Models/LaporanModel.php

    public function getLaporan()
    {
         return $this->db->table('iuran')
         ->join('warga','warga.id=iuran.id_antrean')
         ->get()->getResultArray();
---
SELECT *
FROM `iuran`
JOIN `warga` ON `warga`.`id`=`iuran`.`id_antrean`